Repository: Distrotech/parted
Catalog: doc/*/parted.8.*.po
Languages: pt_br

source: 18 Mar, 2002
pt_br: 18 de Março de 2002

source: GNU Parted Manual
pt_br: Manual do GNU Parted

source: NAME
pt_br: NOME

source: GNU Parted - a partition manipulation program
pt_br: GNU Parted - um programa para manipulação de partição

source: SYNOPSIS
pt_br: SINOPSE

source: B<parted> [options] [device [command [options...]...]]
pt_br: B<parted> [opções] [dispositivo [comando [opções...]...]]

source: DESCRIPTION
pt_br: DESCRIÇÃO

source: This manual page documents briefly the B<parted> command. Complete documentation is distributed with the package in GNU Info format; see below.
pt_br: Esta página de manual documenta brevemente o comando B<parted>. Documentação completa é distribuída com o pacote no formato GNU Info; veja abaixo.

source: B<parted> is a disk partitioning and partition resizing program. It allows you to create, destroy, resize, move and copy ext2, ext3, linux-swap, FAT, FAT32, and reiserfs partitions. It can create, resize and move Macintosh HFS partitions, as well as detect jfs, ntfs, ufs, and xfs partitions. It is useful for creating space for new operating systems, reorganising disk usage, and copying data to new hard disks.
pt_br: B<parted> é um programa de particionamento de disco e redimensionamento de partição. Ele permite que você crie, destrua, redimensione, mova e copie partições ext2, ext3, linux-swap, FAT, FAT32 e reiserfs. Ele pode criar, redimensionar e mover partições Macintosh HFS, assim como detectar partições jfs, ntfs, ufs e xfs. Ele é útil para criar espaço para novos sistemas operacionais, reorganizar utilização de disco e copiar dados para novos discos rígidos.

source: OPTIONS
pt_br: OPÇÕES

source: displays a help message.
pt_br: mostra uma mensagem de ajuda.

source: where necessary, prompts for user intervention.
pt_br: onde necessário, pede intervenção do usuário.

source: never prompts for user intervention.
pt_br: nunca pede intervenção do usuário.

source: displays the version.
pt_br: mostra a versão.

source: COMMANDS
pt_br: COMANDOS

source: B<[device]>
pt_br: B<[dispositivo]>

source: The block device to partition.
pt_br: O dispositivo a ser particionado.

source: B<[command [options]]>
pt_br: B<[comando [opções]]>

source: Specifies a command to parted. If no command is given, parted will give you a command prompt. Commands are:
pt_br: Especifica um comando para o parted. Se nenhum comando for dado, o parted apresentará um pedido de comando. Os comandos são:

source: B<check >I<partition>
pt_br: B<check >I<partição>

source: does a simple check on I<partition>.
pt_br: faz uma checagem simples em I<partição>.

source: B<cp >I<[source-device]>B< >I<source>B< >I<dest>
pt_br: B<cp >I<[dispositivo-origem]>B< >I<origem>B< >I<destino>

source: copies the I<source> partition's filesystem on I<source-device> (or the current device if no other device was specified) to the I<dest> partition on the current device.
pt_br: copia o sistema de arquivos da partição I<origem> do dispositivo I<dispositivo-origem> (ou o dispositivo atual caso nenhum dispositivo tenha sido especificado) para a partição I<destino> no dispositivo atual.

source: B<help >I<[command]>
pt_br: B<help >I<[comando]>

source: prints general help, or help on I<command> if specified.
pt_br: imprime ajuda geral ou sobre I<comando>, caso especificado.

source: B<mkfs >I<partition>B< >I<fs-type>
pt_br: B<mkfs >I<partição>B< >I<tipo-sistema-arquivos>

source: make a filesystem I<fs-type> on I<partition>. I<fs-type> can be one of "fat16", "fat32", "ext2", "linux-swap" or "reiserfs".
pt_br: faz um sistema de arquivos I<tipo-sistema-arquivos> em I<partição>. I<tipo-sistema-arquivos> pode ser um dos "fat16", "fat32", "ext2", "linux-swap" ou "reiserfs".

source: B<mklabel >I<label-type>
pt_br: B<mklabel >I<tipo-marca>

source: Creates a new disklabel (partition table) of I<label-type>. I<label-type> should be one of "bsd", "dvh", "gpt", "loop", "mac", "msdos", "pc98" or "sun".
pt_br: Cria uma nova marca de disco (tabela de partição) do tipo I<tipo-marca>. I<tipo-marca> pode ser um dos "bsd", "dvh", "gpt", "loop", "mac", "msdos", "pc98" ou "sun".

source: B<mkpart >I<part-type>B< >I<[fs-type]>B< >I<start>B< >I<end>
pt_br: B<mkpart >I<tipo-partição>B< >I<[tipo-sistema-arquivos]>B< >I<começo>B< >I<fim>

source: make a I<part-type> partition with filesystem I<fs-type> (if specified), beginning at I<start> and ending at I<end> (in megabytes). I<fs-type> can be one of "fat16", "fat32", "ext2", "HFS", "linux-swap", "NTFS", "reiserfs" or "ufs". I<part-type> should be one of "primary", "logical" or "extended"
pt_br: faz uma partição I<tipo-partição> com o sistema de arquivos I<tipo-sistema-arquivos> (se especificado), começando em I<começo> e terminando em I<fim> (em megabytes). I<tipo-sistema-arquivos> pode ser um dos "fat16", "fat32", "ext2", "HFS", "linux-swap", "NTFS", "reiserfs" ou "ufs". I<tipo-partição> deve ser um dos "primary", "logical" ou "extended"

source: B<mkpartfs >I<part-type>B< >I<fs-type>B< >I<start>B< >I<end>
pt_br: B<mkpartfs >I<tipo-partição>B< >I<tipo-sistema-arquivos>B< >I<começo>B< >I<fim>

source: make a I<part-type> partition with filesystem I<fs-type> beginning at I<start> and ending at I<end> (in megabytes)
pt_br: faz uma partição I<tipo-partição> com sistema de arquivos I<tipo-sistema-arquivos> começando em I<começo> e terminando em I<end> (em megabytes)

source: B<move >I<partition>B< >I<start>B< >I<end>
pt_br: B<move >I<partição>B< >I<começo>B< >I<fim>

source: move I<partition> to start at I<start> and end at I<end>. Note: move never changes the minor number
pt_br: move I<partição> para começar em I<começo> e terminar em I<fim>. Nota: move nunca altera o menor número

source: B<name >I<partition>B< >I<name>
pt_br: B<name >I<partição>B< >I<nome>

source: set the name of I<partition> to I<name>. This option works only on Mac and PC98 disklabels. The name can be placed in quotes, if necessary
pt_br: estabelece o nome de I<partição> como I<nome>. Esta opção funciona apenas em tabelas de partição de Mac e PC98. O nome pode ser colocado entre aspas, se necessário

source: displays the partition table
pt_br: mostra a tabela de partição

source: exits parted
pt_br: sai do parted

source: B<resize >I<partition>B< >I<start>B< >I<end>
pt_br: B<resize >I<partição>B< >I<começo>B< >I<fim>

source: resize the filesystem on I<partition> to start at I<start> and end at I<end> megabytes
pt_br: redimensiona o sistema de arquivos em I<partição> para começar em I<começo> e terminar em I<fim> megabytes

source: B<rm >I<partition>
pt_br: B<rm >I<partição>

source: deletes I<partition>
pt_br: deletes I<partição>

source: B<select >I<device>
pt_br: B<select >I<dispositivo>

source: choose I<device> as the current device to edit. I<device> should usually be a Linux hard disk device, but it can be a partition, software raid device or a LVM logical volume if that is necessary
pt_br: escolhe I<dispositivo> como o atual dispositivo para edição. Normalmente I<dispositivo> deveria ser um dispositivo de disco rígido Linux, mas pode ser uma partição, dispositivo raid ou um volume lógico LVM se for necessário

source: B<set >I<partition>B< >I<flag>B< >I<state>
pt_br: B<set >I<partição>B< >I<sinal>B< >I<estado>

source: change the state of the I<flag> on I<partition> to I<state>. Flags supported are: "boot", "root", "swap", "hidden", "raid", "lvm", "lba" and "palo". I<state> should be either "on" or "off"
pt_br: muda o estado do I<sinal> em I<partição> para I<estado>. Sinais suportados são: "boot", "root", "swap", "hidden", "raid", "lvm", "lba" e "palo". I<estado> deve ser "on" ou "off"

source: REPORTING BUGS
pt_br: REPORTANDO ERROS

source: Report bugs to E<lt>bug-parted@gnu.orgE<gt>
pt_br: Reporte erros para E<lt>bug-parted@gnu.orgE<gt>

source: SEE ALSO
pt_br: VEJA TAMBÉM

source: B<fdisk>(8), B<mkfs>(8), The I<parted> program is fully documented in the B<info(1)> format I<GNU partitioning software> manual.
pt_br: B<fdisk>(8), B<mkfs>(8), o programa I<parted> é completamente documentado no manual do I<programa de particionamento GNU> no formato B<info(1)>.

source: AUTHOR
pt_br: AUTOR

source: This manual page was written by Timshel Knoll E<lt>timshel@debian.orgE<gt>, for the Debian GNU/Linux system (but may be used by others).
pt_br: Esta página de manual foi escrita por Timshel Knoll E<lt>timshel@debian.orgE<gt>, para o sistema Debian GNU/Linux (mas pode ser usada por outros).
