Repository: Distrotech/parted
Catalog: po/*.po
Languages: pl

source: If you convert to FAT32, and MS Windows is installed on this partition, then you must re-install the MS Windows boot loader. If you want to do this, you should consult the Parted manual (or your distribution's manual). Also, converting to FAT32 will make the file system unreadable by MS DOS, MS Windows 95a, and MS Windows NT.
pl: Je¿eli dokonasz konwersji do FAT32 i system MS Windows jest zainstalowany na tej partycji, to wtedy musisz przeinstalowaæ program ³aduj±cy (boot loader) MS Windows. Je¶li chcesz to zrobiæ, to proszê przeczytaj dokumentacjê programu Parted (lub dokumentacjê Twojej dystrybucji systemu). Ponadto, konwersja do FAT32 spowoduje, ¿e taki system plików bêdzie niemo¿liwy do odczytania przez systemy MS-DOS, MS Windows 95a oraz MS Windows NT.

source: Would you like to use FAT32?
pl: Czy chcesz u¿yæ FAT32?

source: The file system can only be resized to this size by converting to FAT16.
pl: Rozmiar systemu plików mo¿e byæ tylko zmieniony poprzez konwersjê do FAT16.

source: The file system can only be resized to this size by converting to FAT32.
pl: System plików mo¿e mieæ zmieniony rozmiar, ale tylko poprzez konwersjê do FAT32.

source: GNU Parted cannot resize this partition to this size. We're working on it!
pl: GNU Parted nie mo¿e zmieniæ rozmiaru tej partycji do podanego. Pracujemy nad tym!

source: File system has an invalid signature for a FAT file system.
pl: System plików posiada nieprawid³owy podpis dla systemu plików FAT.

source: File system has an invalid sector size for a FAT file system.
pl: System plików posiada nieprawid³owy rozmiar sektora dla systemu plików FAT.

source: File system has an invalid cluster size for a FAT file system.
pl: System plików posiada nieprawid³owy rozmiar klastra dla systemu plików FAT.

source: File system has an invalid number of reserved sectors for a FAT file system.
pl: System plików posiada nieprawid³ow± ilo¶æ zarezerwowanych sektorów dla systemu plików FAT.

source: File system has an invalid number of FATs.
pl: System plików posiada nieprawid³ow± ilo¶æ FATów.

source: This file system has a logical sector size of %d. GNU Parted is known not to work properly with sector sizes other than 512 bytes.
pl: Ten system plików posiada rozmiar logicznego sektora %d. GNU Parted nie wspó³pracuje prawid³owo z rozmiarami sektorów innymi ni¿ 512 bajtów.

source: The file system's CHS geometry is (%d, %d, %d), which is invalid. The partition table's CHS geometry is (%d, %d, %d). If you select Ignore, the file system's CHS geometry will be left unchanged. If you select Fix, the file system's CHS geometry will be set to match the partition table's CHS geometry.
pl: Geometri± CHS systemu pliku jest (%d, %d, %d), która nie jest prawid³owa. Geometri± CHS tablicy partycji jest (%d, %d, %d). Je¶li zignorujesz, to geometria CHS systemu pliku pozostanie niezmieniona. Je¶li zdecydujesz siê naprawiæ, geometria CHS systemu plików zostanie dopasowana do geometrii CHS tablicy partycji.

source: FAT boot sector says logical sector size is 0. This is weird.
pl: Sektor rozruchowy FAT mówi, ¿e rozmiar sektora logicznego jest 0. Dziwne.

source: FAT boot sector says there are no FAT tables. This is weird.
pl: Sektor rozruchowy FAT mówi, ¿e nie ma ¿adnych tablic FAT. Dziwne.

source: FAT boot sector says clusters are 0 sectors. This is weird.
pl: Sektor rozruchowy FAT mówi, ¿e klastry zajmuj± 0 sektorów. Dziwne.

source: File system is FAT12, which is unsupported.
pl: Systemem plików jest FAT12, który nie jest wspierany.

source: The information sector has the wrong signature (%x). Select cancel for now, and send in a bug report. If you're desperate, it's probably safe to ignore.
pl: Sektor informacyjny posiada nieprawid³owy podpis (%x). Na razie poniechaj aktualn± operacjê i wy¶lij raport dotycz±cy b³êdów. Ewentualnie zignoruj ca³± sytuacjê.

source: Bad directory entry for %s: first cluster is the end of file marker.
pl: Nieprawid³owy wpis w katalogu dla %s: pierwszy klaster jest znacznikiem koñca pliku.

source: Bad FAT: unterminated chain for %s. You should run dosfsck or scandisk.
pl: Nieprawid³owy FAT: niezakoñczony ³añcuch dla %s. Proszê uruchomiæ program dosfsck lub scandisk.

source: Bad FAT: cluster %d outside file system in chain for %s. You should run dosfsck or scandisk.
pl: Nieprawid³owy FAT: klaster %d jest poza systemem plików w ³añcuchu dla %s. Proszê uruchomiæ program dosfsck lub scandisk.

source: Bad FAT: cluster %d is cross-linked for %s. You should run dosfsck or scandisk.
pl: Nieprawid³owy FAT: klaster %d jest dowi±zany skro¶nie dla %s. Proszê uruchomiæ program dosfsck lub scandisk.

source: %s is %dk, but it has %d clusters (%dk).
pl: %s ma %dk, jednak ma %d klastrów (%dk).

source: The file %s is marked as a system file. This means moving it could cause some programs to stop working.
pl: Plik %s jest oznaczony jako plik systemowy. Oznacza to, ¿e jego przesuniêcie mo¿e spowodowaæ nieprawid³ow± pracê innych programów.

source: FAT %d media %x doesn't match the boot sector's media %x. You should probably run scandisk.
pl: Typ no¶nika odczytany z FAT %d (%x) nie zgadza siê z typem odczytanym z sektora rozruchowego (%x). Nale¿y uruchomiæ scandisk.

source: fat_table_set: cluster %ld outside file system
pl: fat_table_set: klaster %ld poza systemem plików

source: fat_table_get: cluster %ld outside file system
pl: fat_table_get: klaster %ld poza systemem plików

source: fat_table_alloc_cluster: no free clusters
pl: fat_table_alloc_cluster: brak wolnych klastrów

source: Unrecognised linux swap signature '%10s'.
pl: Nierozpoznany podpis linuxowej partycji wymiany `%10s'.

source: Too many bad pages.
pl: Zbyt du¿o nieprawid³owych stron.

source: The file system contains errors.
pl: System plików zawiera b³êdy.

source: Bad blocks could not be read.
pl: Uszkodzone bloki nie mog± byæ odczytane.

source: Trying to register an extent starting at block 0x%X, but another one already exists at this position. You should check the file system!
pl: Podczas próby zarejestrowania obszaru z pocz±tkiem na bloku 0x%X wykryto inny obszar na tej pozycji. Nale¿y sprawdziæ system plików!

source: Trying to move an extent from block Ox%X to block Ox%X, but another one already exists at this position. This should not happen!
pl: Podczas próby przeniesienia obszaru z bloku 0x%X do bloku 0x%X wykryto inny obszar na tej pozycji. To nie powinno siê zdarzyæ!

source: Sorry, HFS cannot be resized that way yet.
pl: Przykro mi, ale nie mo¿na w ten sposób zmieniæ rozmiaru HFS.

source: Data relocation has failed.
pl: Relokacja danych nie powiod³a siê.

source: Data relocation left some data in the end of the volume.
pl: Relokacja danych pozostawi³a dane pod koniec wolumenu.

source: writing HFS Master Directory Block
pl: zapisywanie g³ównego bloku katalogu HFS (HFS Master Directory Block)

source: Version %d of HFS+ isn't supported.
pl: Wersja %d HFS+ nie jest wspierana.

source: Data relocation left some data at the end of the volume.
pl: Relokacja danych pozostawi³a dane na koñcu wolumenu.

source: Error while writing the allocation file.
pl: B³±d podczas zapisu pliku przydzia³u.

source: Error while writing the compatibility part of the allocation file.
pl: B³±d podczas zapisu kompatybilnej czê¶ci pliku przydzia³u.

source: writing HFS+ Volume Header
pl: zapisywanie nag³ówka wolumenu HFS+

source: An error occurred while looking for the mandatory bad blocks file.
pl: Wyst±pi³ b³±d podczas szukania obowi±zkowego pliku uszkodzonych bloków.

source: It seems there is an error in the HFS wrapper: the bad blocks file doesn't contain the embedded HFS+ volume.
pl: Prawdopodobnie wystêpuje b³±d w otoczce HFS: plik uszkodzonych bloków nie zawiera wbudowanego wolumenu HFS+.

source: shrinking embedded HFS+ volume
pl: zmniejszanie wbudowanego wolumenu HFS+

source: Resizing the HFS+ volume has failed.
pl: Zmiana rozmiaru wolumenu HFS+ nie powiod³a siê.

source: shrinking HFS wrapper
pl: zmniejszanie otoczki HFS

source: Updating the HFS wrapper has failed.
pl: Aktualizacja otoczki HFS nie powiod³a siê.

source: This is not a real %s check. This is going to extract special low level files for debugging purposes.
pl: To nie jest prawdziwe sprawdzanie %s. Celem jest wydobycie specjalnych niskopoziomowych plików w celu odpluskwiania.

source: An extent has not been relocated.
pl: Obszar nie zosta³ przeniesiony.

source: A reference to an extent comes from a place it should not. You should check the file system!
pl: Odwo³anie do obszaru nie powinno by³o wyst±piæ w tym miejscu. Nale¿y sprawdziæ system plików!

source: This HFS volume has no catalog file. This is very unusual!
pl: Ten wolumen HFS nie posiada pliku katalogowego. To jest bardzo niezwyk³e!

source: The extents overflow file should not contain its own extents! You should check the file system.
pl: Plik przepe³nienia obszarów nie powinien zawieraæ w³asnych obszarów! Nale¿y sprawdziæ system plików.

source: Could not cache the file system in memory.
pl: Nie mo¿na zapamiêtaæ systemu plików w pamiêci.

source: Bad blocks list could not be loaded.
pl: Nie powiod³o siê za³adowanie listy uszkodzonych bloków.

source: An error occurred during extent relocation.
pl: Wykryto b³±d podczas przenoszenia obszaru.

source: This HFS+ volume has no catalog file. This is very unusual!
pl: Ten wolumen HFS+ nie posiada pliku katalogowego. To jest bardzo niezwyk³e!

source: This HFS+ volume has no extents overflow file. This is quite unusual!
pl: Ten tom HFS+ nie zawiera pliku przepe³nienia obszarów. To raczej niezwykle!

source: displays this help message
pl: wy¶wietla tê oto pomoc

source: where necessary, prompts for user intervention
pl: gdy jest potrzeba, prosi o interwencjê u¿ytkownika

source: never prompts for user intervention
pl: nigdy nie prosi u¿ytkownika o interwencjê

source: displays the version
pl: wy¶wietla numer wersji

source: LABEL-TYPE is one of:
pl: TYP-ETYKIETY stanowi jedn± z nastêpuj±cych warto¶ci:

source: FLAG is one of:
pl: FLAGA stanowi jedn± z nastêpuj±cych warto¶ci:

source: UNIT is one of:
pl: JEDNOSTKA stanowi jedn± z nastêpuj±cych warto¶ci:

source: PART-TYPE is one of: primary, logical, extended
pl: TYP-PARTYCJI stanowi jedn± z nastêpuj±cych warto¶ci: g³ówna, logiczna, rozszerzona

source: FS-TYPE is one of:
pl: SYSTEM-PLIKÓW stanowi jedn± z nastêpuj±cych warto¶ci:

source: STATE is one of: on, off
pl: STAN jest reprezentowany poprzez: w³±czony, wy³±czony

source: DEVICE is usually /dev/hda or /dev/sda
pl: URZ¡DZENIEM jest zwykle /dev/hda lub /dev/sda

source: NAME is any word you want
pl: NAZWA jest dowolnym s³owem jakie chcesz

source: The partition must have one of the following FS-TYPEs:
pl: Partycja musi posiadaæ jeden z nastêpuj±cych systemów plików:

source: %0.f%% (time left %.2d:%.2d)
pl: %0.f%% (czas do koñca %.2d:%.2d)

source: Partition %s is being used. You must unmount it before you modify it with Parted.
pl: Partycja %s jest u¿ywana. Nale¿y j± od³±czyæ przed jej modyfikacj±.

source: Partition(s) on %s are being used.
pl: Partycja (partycje) na %s s± u¿ywane.

source: Partition number?
pl: Numer partycji?

source: Source device?
pl: Urz±dzenie ¼ród³owe?

source: Source partition number?
pl: Numer partycji ¼ród³owej?

source: Can't copy an extended partition.
pl: Nie mo¿na skopiowaæ rozszerzonej partycji.

source: Destination partition number?
pl: Numer partycji docelowej?

source: New disk label type?
pl: Nowy typ etykiety dysku?

source: File system?
pl: System plików?

source: Partition type?
pl: Typ partycji?

source: Partition name?
pl: Nazwa partycji?

source: File system type?
pl: Typ systemu plików?

source: Start?
pl: Pocz±tek?

source: End?
pl: Koniec?

source: An extended partition cannot hold a file system. Did you want mkpart?
pl: Rozszerzona partycja nie mo¿e trzymaæ systemu plików. Czy chodzi³o Ci o mkpart?

source: Can't move an extended partition.
pl: Nie mo¿na przesun±æ rozszerzonej partycji.

source: Can't move a partition onto itself. Try using resize, perhaps?
pl: Nie mo¿na przesun±æ partycji na sam± siebie. Mo¿e spróbuj zmieniæ jej rozmiar?

source: Minor: %d
pl: Numer: %d

source: File System: %s
pl: System plików: %s

source: Size:
pl: Rozmiar:

source: Minimum size:
pl: Minimalny rozmiar:

source: Maximum size:
pl: Maksymalny rozmiar:

source: BIOS cylinder,head,sector geometry: %d,%d,%d. Each cylinder is %s.
pl: Geometria BIOS cylinder,g³owica,sektor: %d,%d,%d. Ka¿dy cylinder ma %s.

source: Number
pl: Numer

source: Start
pl: Pocz±tek

source: End
pl: Koniec

source: Size
pl: Rozmiar

source: Type
pl: Typ

source: File system
pl: System plików

source: Name
pl: Nazwa

source: Flags
pl: Flaga

source: A %s %s partition was found at %s -> %s. Do you want to add it to the partition table?
pl: Partycja %s %s zosta³a znaleziona na %s -> %s. Czy chcesz j± dodaæ do tablicy partycji?

source: searching for file systems
pl: szukam systemów plików

source: New device?
pl: Nowe urz±dzenie?

source: New state?
pl: Nowy stan?

source: Unit?
pl: Jednostka?

source: check
pl: sprawd¼

source: cp
pl: kopiuj

source: cp [FROM-DEVICE] FROM-NUMBER TO-NUMBER copy file system to another partition
pl: cp [URZ¡DZENIE-¬RÓD£OWE] NUMER-¬RÓD£OWY NUMER-DOCELOWY kopiuje system plików na inn± partycjê

source: help
pl: pomoc

source: mkpart PART-TYPE [FS-TYPE] START END make a partition
pl: mkpart TYP-PARTYCJI [SYSTEM-PLIKÓW] POCZ¡TEK KONIEC tworzy partycjê

source: mkpart makes a partition without creating a new file system on the partition. FS-TYPE may be specified to set an appropriate partition ID.
pl: Komenda mkpart tworzy partycjê bez tworzenia nowego systemu plików na tej partycji. Opcjonalny SYSTEM-PLIKÓW mo¿e zostaæ podany do okre¶lenia w³a¶ciwego identyfikatora partycji.

source: mkpartfs PART-TYPE FS-TYPE START END make a partition with a file system
pl: mkpartfs TYP-PARTYCJI SYSTEM-PLIKÓW POCZ¡TEK KONIEC tworzy partycjê z systemem plików

source: move
pl: przesuñ

source: name
pl: nazwa

source: print
pl: drukuj

source: quit
pl: koniec

source: rescue
pl: uratuj

source: resize
pl: rozmiar

source: rm
pl: usuñ

source: select
pl: wybierz

source: set
pl: ustaw

source: unit
pl: jednostka

source: No device found
pl: Nie znaleziono urz±dzenia

source: Don't forget to update /etc/fstab, if necessary.
pl: Nie zapomnij o aktualizacji /etc/fstab, je¶li istnieje taka potrzeba.

source: Expecting a partition number.
pl: Oczekiwany by³ numer partycji.

source: Partition doesn't exist.
pl: Partycja nie istnieje.

source: Expecting a file system type.
pl: Oczekiwany by³ typ systemu plików.

source: Unknown file system type "%s".
pl: Nieznany typ systemu plików "%s".

source: Expecting a disk label type.
pl: Oczekiwany by³ typ etykiety dysku.

source: Can't create any more partitions.
pl: Nie mo¿na utworzyæ wiêcej partycji.

source: Expecting a partition type.
pl: Oczekiwany by³ typ partycji.

source: on
pl: w³±czone

source: off
pl: wy³±czone

source: OPTIONs:
pl: OPCJE:

source: COMMANDs:
pl: KOMENDY:

source: Using %s
pl: U¿ycie %s
