Repository: Distrotech/parted
Catalog: po/*.po
Languages: pl

source: Could not stat device %s - %s.
pl: Nie mo¿na sprawdziæ urz±dzenia %s - %s.

source: Unable to determine the size of %s (%s).
pl: Nie mo¿na ustaliæ rozmiaru %s (%s).

source: Could not get identity of device %s - %s
pl: Nie mo¿na uzyskaæ to¿samo¶ci urz±dzenia %s - %s

source: Error initialising SCSI device %s - %s
pl: B³±d podczas inicjalizacji urz±dzenia SCSI %s - %s

source: DAC960 RAID controller
pl: Kontroler DAC960 RAID

source: ATARAID Controller
pl: Kontroler ATARAID

source: I2O Controller
pl: Kontroler I20

source: Unknown
pl: Nieznane

source: ped_device_new() Unsupported device type
pl: ped_device_new() Ten typ urz±dzenia nie jest wspierany

source: Error opening %s: %s
pl: B³±d podczas otwierania %s: %s

source: Unable to open %s read-write (%s). %s has been opened read-only.
pl: Nie mo¿na otworzyæ %s jednocze¶nie w trybie do odczytu i zapisu (%s). %s zosta³ otwarty tylko w trybie do odczytu.

source: %s during read on %s
pl: %s podczas czytania %s

source: %s during seek for read on %s
pl: %s podczas ustawiania do odczytu na %s

source: %s during write on %s
pl: %s podczas zapisu %s

source: Can't write to %s, because it is opened read-only.
pl: Nie mo¿na zapisaæ do %s, poniewa¿ otwarte jest tylko do czytania.

source: %s during seek for write on %s
pl: %s podczas ustawiania do zapisu na %s

source: Error informing the kernel about modifications to partition %s -- %s. This means Linux won't know about any changes you made to %s until you reboot -- so you shouldn't mount it or use it in any way before rebooting.
pl: B³±d podczas informowania j±dra systemu o modyfikacji partycji %s -- %s. Oznacza to, ¿e Linux nie bêdzie wiedzia³ o ¿adnych zmianach jakie zosta³y dokonane na %s a¿ do czasu ponownego uruchomienia komputera -- proszê nie pod³±czaæ ani u¿ywaæ tej partycji do czasu ponownego uruchomienia komputera.

source: The kernel was unable to re-read the partition table on %s (%s). This means Linux won't know anything about the modifications you made until you reboot. You should reboot your computer before doing anything with %s.
pl: J±dro systemu nie mog³o ponownie odczytaæ tablicy partycji na %s (%s). Oznacza to, ¿e Linux nie bêdzie wiedzia³ nic o modyfikacjach jakie zosta³y poczynione a¿ do czasu ponownego uruchomienia komputera. Nale¿y ponownie uruchomiæ komputer zanim wykonasz jak±kolwiek operacjê na %s.

source: Unable to open %s.
pl: Nie mo¿na otworzyæ %s.

source: Unable to probe store.
pl: Detekcja geometrii nie powiod³a siê.

source: The partition table cannot be re-read. This means you need to reboot before mounting any modified partitions. You also need to reinstall your boot loader before you reboot (which may require mounting modified partitions). It is impossible do both things! So you'll need to boot off a rescue disk, and reinstall your boot loader from the rescue disk. Read section 4 of the Parted User documentation for more information.
pl: Nie mo¿na ponownie odczytaæ tablicy partycji. Nale¿y ponownie uruchomiæ komputer przed pod³±czeniem jakichkolwiek zmodyfikowanych partycji. Nale¿y tak¿e przeinstalowaæ program ³aduj±cy (boot loader) zanim uruchomisz ponownie komputer (co mo¿e wymagaæ pod³±czenia zmodyfikowanych partycji). Wykonanie dwóch powy¿szych rzeczy jest niemo¿liwe! A wiêc pozostaje Ci uruchomienie dysku/p³yty ratunkowej i przeinstalowanie programu ³aduj±cego prosto z dysku ratunkowego. Przeczytaj rozdzia³ 4 dokumentacji programu GNU Parted, aby uzyskaæ wiêcej informacji na ten temat.

source: The partition table on %s cannot be re-read (%s). This means the Hurd knows nothing about any modifications you made. You should reboot your computer before doing anything with %s.
pl: Nie mo¿na ponownie wczytaæ tablicy partycji na %s (%s). Oznacza to, ¿e Hurd nie wie o ¿adnych zmianach jakie zosta³y wprowadzone. Nale¿y ponownie uruchomiæ komputer zanim wykonasz jak±kolwiek operacjê na %s.

source: You should reinstall your boot loader before rebooting. Read section 4 of the Parted User documentation for more information.
pl: Nale¿y przeinstalowaæ program ³aduj±cy (boot loader) przed ponownym uruchomieniem komputera. Przeczytaj rozdzia³ 4 dokumentacji u¿ytkownika Parted, aby uzyskaæ wiêcej informacji.

source: %s trying to sync %s to disk
pl: B³±d synchronizacji %s do dysku %s

source: Unable to open %s - unrecognised disk label.
pl: Nie mo¿na otworzyæ %s - nierozpoznana etykieta dysku.

source: This libparted doesn't have write support for %s. Perhaps it was compiled read-only.
pl: Biblioteka libparted nie posiada obs³ugi zapisu dla %s. Byæ mo¿e zosta³a ona zbudowana z obs³ug± tylko-do-odczytu.

source: Partition %d is %s, but the file system is %s.
pl: Partycja %d jest %s, lecz system plików jest %s.

source: %s disk labels do not support extended partitions.
pl: Etykiety dysku %s nie wspieraj± rozszerzonych partycji.

source: %s disk labels don't support logical or extended partitions.
pl: Etykiety dysku %s nie wspieraj± logicznych lub rozszerzonych partycji.

source: Too many primary partitions.
pl: Zbyt du¿o partycji g³ównych.

source: Can't add a logical partition to %s, because there is no extended partition.
pl: Nie mo¿na dodaæ logicznej partycji do %s, poniewa¿ nie istnieje rozszerzona partycja.

source: Can't have more than one extended partition on %s.
pl: Nie mo¿na mieæ wiêcej ni¿ jedn± rozszerzon± partycjê na %s.

source: Can't have logical partitions outside of the extended partition.
pl: Nie mo¿na mieæ logicznych partycji poza rozszerzon± partycj±.

source: Can't have a logical partition outside of the extended partition on %s.
pl: %s nie mo¿e mieæ logicznej partycji poza rozszerzon± partycj±.

source: Can't have overlapping partitions.
pl: Nie mo¿na mieæ nak³adaj±cych siê partycji.

source: Can't have a primary partition inside an extended partition.
pl: Nie mo¿na mieæ g³ównej partycji wewn±trz rozszerzonej partycji.

source: metadata
pl: metadane

source: free
pl: wolna

source: extended
pl: rozszerzona

source: logical
pl: logiczna

source: primary
pl: g³ówna

source: boot
pl: ³adowalna

source: swap
pl: wymiany

source: hidden
pl: ukryta

source: hp-service
pl: us³uga-hp

source: Unknown partition flag, %d.
pl: Nieznana flaga partycji, %d.

source: %s : Bad checksum on block %llu of type %s.
pl: %s : Nieprawid³owa suma kontrolna bloku %llu typu %s.

source: %s : Didn't find rdb block, should never happen.
pl: %s : Nie znaleziono bloku rdb, co nie powinno siê zdarzyæ.

source: %s : Loop detected at block %d.
pl: %s : Wykryto pêtlê na bloku %d.

source: %s : The %s list seems bad at block %s.
pl: %s : Lista %s wydaje siê byæ uszkodzona na bloku %s.

source: %s : Failed to list bad blocks.
pl: %s : Nie powiod³o siê wypisanie uszkodzonych bloków.

source: %s : Failed to list partition blocks.
pl: %s : Wypisanie bloków partycji nie powiod³o siê.

source: %s : Failed to list file system blocks.
pl: %s : Wypisanie bloków systemu plików nie powiod³o siê.

source: %s : Failed to list boot blocks.
pl: %s : Nie powiod³o siê wypisanie bloków rozruchowych.

source: Failed to write partition block at %d.
pl: Nie powiód³ siê zapis bloku partycji na %d.

source: Unable to satisfy all constraints on the partition.
pl: Nie mo¿na zaspokoiæ wszystkich ograniczeñ na partycji.

source: Unable to allocate a partition number.
pl: Nie mo¿na przydzieliæ numeru partycji.

source: Unable to allocate a bsd disklabel slot.
pl: Nie mo¿na przydzieliæ miejsca na etykietê dysku bsd.

source: Invalid partition table on %s -- wrong signature %x.
pl: Nieprawid³owa tablica partycji na %s -- b³êdna sygnatura %x.

source: Invalid partition table - recursive partition on %s.
pl: Nieprawid³owa tablica partycji - partycja rekursywna na %s.

source: Extended partitions cannot be hidden on msdos disk labels.
pl: Rozszerzone partycje nie mog± byæ ukryte dla etykieta dysków msdos.

source: Parted can't resize partitions managed by Windows Dynamic Disk.
pl: Parted nie mo¿e zmieniæ rozmiaru partycji zarz±dzanych przez Windows Dynamic Disk.

source: Checksum is wrong, indicating the partition table is corrupt.
pl: Suma kontrolna jest b³êdna i oznacza to, ¿e tablica partycji jest uszkodzona.

source: Only primary partitions can be root partitions.
pl: Tylko g³ówne partycje mog± byæ typu root.

source: Only primary partitions can be swap partitions.
pl: Tylko g³ówne partycje mog± byæ partycjami wymiany.

source: Only logical partitions can be a boot file.
pl: Tylko logiczne partycje mog± byæ plikami ³adowalnymi (boot).

source: Only logical partitions (boot files) have a name.
pl: Tylko logiczne partycje (³adowalne pliki) maj± nazwy.

source: Too many primary partitions
pl: Zbyt du¿o partycji g³ównych

source: %s contains GPT signatures, indicating that it has a GPT table. However, it does not have a valid fake msdos partition table, as it should. Perhaps it was corrupted -- possibly by a program that doesn't understand GPT partition tables. Or perhaps you deleted the GPT table, and are now using an msdos partition table. Is this a GPT partition table?
pl: %s zawiera sygnaturê GPT. Oznacza to, ¿e posiada tablicê GPT, ale nie posiada prawid³owej fa³szywej tablicy partycji msdos, tak jak powinna. Byæ mo¿e jest uszkodzona -- mo¿liwe, ¿e przez program, który nie rozumie tablic partycji GPT. Albo te¿ tablica GPT zosta³a skasowana, za¶ teraz u¿ywana jest tablica partycji msdos. Czy to jest tablica partycji GPT?

source: The format of the GPT partition table is version %x, which is newer than what Parted can recognise. Please tell us! bug-parted@gnu.org
pl: Format tablicy partycji GPT (wersja %x) jest nowszy ni¿ program Parted jest w stanie rozpoznaæ. Poinformuj nas o tym! bug-parted@gnu.org

source: The backup GPT table is not at the end of the disk, as it should be. This might mean that another operating system believes the disk is smaller. Fix, by moving the backup to the end (and removing the old backup)?
pl: Kopia zapasowa tablicy GPT nie znajduje siê na koñcu dysku, a powinna. Mo¿e to oznaczaæ, ¿e inny system operacyjny my¶li, ¿e dysk jest mniejszy ni¿ jest w rzeczywisto¶ci. Czy naprawiæ to poprzez przesuniêcie kopii zapasowej na koniec (i usuniêcie starej kopii)?

source: The primary GPT table is corrupt, but the backup appears OK, so that will be used.
pl: G³ówna tablica GPT jest uszkodzona, ale jej kopia zapasowa wydaje siê byæ w porz±dku i zostanie ona u¿yta.

source: Both the primary and backup GPT tables are corrupt. Try making a fresh table, and using Parted's rescue feature to recover partitions.
pl: Obie tablice GPT, g³ówna i jej kopia zapasowa, s± uszkodzone. Spróbuj utworzyæ now± tablicê oraz u¿yj opcjê 'rescue', aby odzyskaæ partycje.

source: Invalid signature %x for Mac disk labels.
pl: Nieprawid³owy podpis %x dla etykiet dysków Mac.

source: Partition map has no partition map entry!
pl: Mapa partycji nie posiada wpisu mapy partycji!

source: %s is too small for a Mac disk label!
pl: %s jest zbyt ma³y dla etykiety dysku Mac!

source: Partition %d has an invalid signature %x.
pl: Partycja %d posiada nieprawid³owy podpis %x.

source: Partition %d has an invalid length of 0 bytes!
pl: Partycja %d posiada nieprawid³ow± d³ugo¶æ 0 bajtów!

source: The data region doesn't start at the start of the partition.
pl: Obszar danych nie rozpoczyna siê na pocz±tku partycji.

source: The boot region doesn't start at the start of the partition.
pl: Obszar rozruchowy nie zaczyna siê na pocz±tku partycji.

source: The partition's boot region doesn't occupy the entire partition.
pl: Obszar rozruchowy partycji nie okupuje ca³ej partycji.

source: The partition's data region doesn't occupy the entire partition.
pl: Obszar danych partycji nie okupuje ca³ej partycji.

source: Weird block size on device descriptor: %d bytes is not divisible by 512.
pl: Dziwny rozmiar bloku w deskryptorze urz±dzenia: %d bajtów nie jest podzielne przez 512.

source: The driver descriptor says the physical block size is %d bytes, but Linux says it is %d bytes.
pl: Deskryptor napêdu mówi, ¿e fizyczny rozmiar bloku wynosi %d bajtów, ale Linux mówi, ¿e wynosi %d bajtów.

source: No valid partition map found.
pl: Nie znaleziono prawid³owej mapy partycji.

source: Conflicting partition map entry sizes! Entry 1 says it is %d, but entry %d says it is %d!
pl: Wyst±pi³ konflikt miêdzy rozmiarami wpisów mapy partycji! Wpis 1 mówi, ¿e jest %d, ale wpis %d mówi, ¿e jest %d!

source: Weird! There are 2 partitions map entries!
pl: Dziwne! Istniej± 2 wpisy map partycji!

source: Changing the name of a root or swap partition will prevent Linux from recognising it as such.
pl: Zmiana nazwy partycji root lub wymiany spowoduje, ¿e Linux jej nie rozpozna.

source: Can't add another partition -- the partition map is too small!
pl: Nie mo¿na dodaæ kolejnej partycji -- mapa partycji jest zbyt ma³a!

source: Invalid partition table on %s.
pl: Nieprawid³owa tablica partycji na %s.

source: Partition %d isn't aligned to cylinder boundaries. This is still unsupported.
pl: Partycja %d nie jest wyrównana do granic cylindra. Nadal nie jest to wspierane.

source: Can't add another partition.
pl: Nie mo¿na dodaæ kolejnej partycji.

source: Corrupted Sun disk label detected.
pl: Wykryto uszkodzon± etykietê dysku Sun.

source: The disk CHS geometry (%d,%d,%d) reported by the operating system does not match the geometry stored on the disk label (%d,%d,%d).
pl: Geometria dysku CHS (%d,%d,%d), zg³oszona przez system operacyjny, nie pasuje do geometrii przechowywanej w etykiecie dysku (%d,%d,%d).

source: The disk label describes a disk bigger than %s.
pl: Etykieta dysku opisuje dysk wiêkszy ni¿ %s.

source: The disk has %d cylinders, which is greater than the maximum of 65536.
pl: Dysk posiada %d cylindrów, co stanowi wiêcej ni¿ dopuszczalny limit 65536.

source: The Whole Disk partition is the only available one left. Generally, it is not a good idea to overwrite this partition with a real one. Solaris may not be able to boot without it, and SILO (the sparc boot loader) appreciates it as well.
pl: Partycja ca³ego dysku jest jedyn± jaka pozosta³a. Generalnie nie jest to dobry pomys³, aby j± nadpisaæ inn±, prawdziw±. System Solaris mo¿e siê bez niej nie uruchomiæ, za¶ SILO (program ³aduj±cy SPARC) równie¿ j± doceni.

source: Sun disk label is full.
pl: Etykieta dysku Sun jest pe³na.

source: Could not detect file system.
pl: Nie mo¿na wykryæ systemu plików.

source: The file system is bigger than its volume!
pl: System plików jest wiêkszy ni¿ jego wolumen!

source: Support for opening %s file systems is not implemented yet.
pl: Wsparcie dla otwierania systemów plików %s nie zosta³o jeszcze zaimplementowane.

source: Support for creating %s file systems is not implemented yet.
pl: Wsparcie dla tworzenia systemów plików %s nie zosta³o jeszcze zaimplementowane.

source: Support for checking %s file systems is not implemented yet.
pl: Wsparcie dla sprawdzania systemów plików %s nie zosta³o jeszcze zaimplementowane.

source: raw block copying
pl: bezpo¶rednie kopiowanie bloków

source: growing file system
pl: powiêkszanie systemu plików

source: Can't copy onto an overlapping partition.
pl: Nie mo¿na skopiowaæ na nak³adaj±c± siê partycjê.

source: Direct support for copying file systems is not yet implemented for %s. However, support for resizing is implemented. Therefore, the file system can be copied if the new partition is at least as big as the old one. So, either shrink the partition you are trying to copy, or copy to a bigger partition.
pl: Bezpo¶rednie wsparcie kopiowania systemów plików dla %s nie jest jeszcze zaimplementowane. Aczkolwiek, wspierana jest zmiana rozmiaru systemu plików. Tak wiêc, system plików mo¿e zostaæ skopiowany, je¶li nowa partycja ma przynajmniej tak± sam± pojemno¶æ jak stara. Mo¿esz tak¿e zmniejszyæ rozmiar partycji, któr± chcesz skopiowaæ lub skopiuj na partycjê o wiêkszym rozmiarze.

source: Support for copying %s file systems is not implemented yet.
pl: Wsparcie dla kopiowania systemów plików %s nie zosta³o jeszcze zaimplementowane.

source: Support for resizing %s file systems is not implemented yet.
pl: Wsparcie dla zmiany wielko¶ci systemów plików %s nie zosta³o jeszcze zaimplementowane.

source: Information
pl: Informacja

source: Warning
pl: Ostrze¿enie

source: Error
pl: B³±d

source: Fatal
pl: Fatalny b³±d

source: Bug
pl: B³±d

source: No Implementation
pl: Brak implementacji

source: Yes
pl: Tak

source: No
pl: Nie

source: Retry
pl: Powtórz

source: Ignore
pl: Zignoruj

source: Cancel
pl: Poniechaj

source: Can't have the end before the start!
pl: Nie mo¿na mieæ koñca przed pocz±tkiem!

source: Can't have a partition outside the disk!
pl: Nie mo¿na mieæ partycji poza dyskiem!

source: Attempt to read sectors %ld-%ld outside of partition on %s.
pl: Próba odczytania sektorów %ld-%ld poza partycj± na %s.

source: Attempt to write sectors %ld-%ld outside of partition on %s.
pl: Próba zapisania sektorów %ld-%ld poza partycj± na %s.

source: checking for bad blocks
pl: sprawdzam czy istniej± uszkodzone bloki

source: Out of memory.
pl: Brak pamiêci

source: Cannot get unit size for special unit 'COMPACT'.
pl: Nie mo¿na pobraæ rozmiaru jednostki dla specjalnej jednostki 'COMPACT'.

source: "%s" has invalid syntax for locations.
pl: "%s" posiada nieprawid³ow± sk³adniê dla lokacji.

source: The maximum head value is %d.
pl: Maksymalna warto¶æ g³owicy wynosi %d.

source: The maximum sector value is %d.
pl: Maksymalna warto¶æ sektora wynosi %d.

source: The location %s is outside of the device %s.
pl: Lokacja %s jest poza urz±dzeniem %s.

source: Invalid number.
pl: Nieprawid³owy numer.

source: Inconsistent group descriptors!
pl: Sprzeczne deskryptory grup!

source: File system full!
pl: Pe³ny system plików!

source: Invalid superblock. Are you sure this is an ext2 file system?
pl: Nieprawid³owy superblok. Czy to na pewno jest system plików ext2?

source: File system has errors! You should run e2fsck.
pl: System plików posiada b³êdy! Uruchom program e2fsck.

source: File system was not cleanly unmounted! You should run e2fsck. Modifying an unclean file system could cause severe corruption.
pl: System plików nie zosta³ prawid³owo od³±czony! Uruchom program e2fsck. Modyfikowanie takiego systemu plików mo¿e spowodowaæ jego uszkodzenie.

source: File system has an incompatible feature enabled.
pl: System plików ma w³±czon± niekompatybiln± funkcjê.

source: Error allocating buffer cache.
pl: B³±d podczas przydzielania pamiêci do bufora podrêcznego.

source: Found an inode with a incorrect link count. Better go run e2fsck first!
pl: Znaleziono i-wêze³ z nieprawid³owym licznikiem dowi±zañ. Lepiej uruchom najpierw program e2fsck!

source: Not enough free inodes!
pl: Zbyt ma³o wolnych i-wêz³ów!

source: File system is too full to remove a group!
pl: System plików jest zbyt pe³ny, aby usun±æ grupê!

source: File system has too many allocated inodes to remove a group!
pl: System plików posiada zbyt du¿o przydzielonych i-wêz³ów, aby usun±æ grupê!

source: adding groups
pl: dodawanie grup

source: Your file system is too full to resize it to %i blocks. Sorry.
pl: Twój system plików jest zbyt pe³ny, aby móc zmieniæ jego rozmiar do %i bloków. Przykro mi.

source: Your file system has too many occupied inodes to resize it to %i blocks. Sorry.
pl: Twój system plików posiada zbyt du¿o okupowanych i-wêz³ów, aby móc zmieniæ jego rozmiar do %i bloków. Przykro mi.

source: shrinking
pl: zmniejszanie

source: File system was not cleanly unmounted! You should run e2fsck.
pl: System plików nie zosta³ prawid³owo od³±czony! Uruchom program e2fsck.

source: The file system has the 'dir_index' feature enabled. Parted can only resize the file system if it disables this feature. You can enable it later by running 'tune2fs -O dir_index DEVICE' and then 'e2fsck -fD DEVICE'.
pl: System plików posiada w³±czon± funkcjê 'dir_index'. Parted mo¿e tylko zmieniæ rozmiar systemu plików je¶li zostanie wy³±czona ta funkcja. Mo¿esz j± w³±czyæ ponownie pó¼niej poprzez uruchomienie 'tune2fs -O dir_index URZ¡DZENIE', a nastêpnie 'e2fsck -fD URZ¡DZENIE'.

source: Cross-linked blocks found! Better go run e2fsck first!
pl: Znaleziono bloki dowi±zane skro¶nie! Lepiej uruchom najpierw program e2fsck!

source: Block %i has no reference? Weird.
pl: Blok %i nie posiada odwo³añ? Dziwne.

source: The ext2 file system passed a basic check. For a more comprehensive check, use the e2fsck program.
pl: System plików ext2 przeszed³ pomy¶lnie podstawowe sprawdzenie. U¿yj program e2fsck, aby wykonaæ bardziej wyczerpuj±ce sprawdzenie.

source: Sorry, can't move the start of ext2 partitions yet!
pl: Przepraszam, ale na razie nie mo¿na przesun±æ pocz±tku partycji ext2!

source: Couldn't flush buffer cache!
pl: Nie mo¿na opró¿niæ bufora pamiêci podrêcznej!

source: writing per-group metadata
pl: zapis metadanych do grup

source: File system too small for ext2.
pl: System plików jest zbyt ma³y dla ext2.

source: You need %s of free disk space to shrink this partition to this size. Currently, only %s is free.
pl: Potrzebujesz %s wolnej przestrzeni, aby zmniejszyæ partycjê do tego rozmiaru. Aktualnie, tylko %s jest wolne.

source: Cluster start delta = %d, which is not a multiple of the cluster size %d.
pl: Pocz±tek klastra delta = %d, a wiêc nie jest to wielokrotno¶æ rozmiaru klastra %d.

source: Partition too big/small for a %s file system.
pl: Partycja jest zbyt du¿a/ma³a dla systemu plików %s.

source: The FATs don't match. If you don't know what this means, then select cancel, run scandisk on the file system, and then come back.
pl: Tablice FAT nie pasuj±. Je¶li nie wiesz co to znaczy, to wybierz 'Poniechaj', uruchom scandisk, a potem ponów próbê.

source: There are no possible configurations for this FAT type.
pl: Nie ma mo¿liwych konfiguracji dla tego typu FAT.

source: File system doesn't have expected sizes for Windows to like it. Cluster size is %dk (%dk expected); number of clusters is %d (%d expected); size of FATs is %d sectors (%d expected).
pl: System plików nie posiada rozmiaru spodziewanego przez system MS Windows. Rozmiar klastra wynosi %dk (powinno byæ %dk); ilo¶æ klastrów wynosi %d (powinno byæ %d); rozmiar FAT wynosi %d sektorów (powinno byæ %d).

source: File system is reporting the free space as %d clusters, not %d clusters.
pl: System plików mówi, ¿e wolna przestrzeñ wynosi %d klastrów, a nie %d klastrów.

source: GNU Parted was miscompiled: the FAT boot sector should be 512 bytes. FAT support will be disabled.
pl: Program GNU Parted zosta³ nieprawid³owo zbudowany: sektor rozruchowy FAT powinien mieæ 512 bajtów. Wsparcie dla FAT zostaje wy³±czone.

source: There's not enough room in the root directory for all of the files. Either cancel, or ignore to lose the files.
pl: Brakuje miejsca w katalogu root dla wszystkich tych plików. Poniechaj operacjê lub zignoruj, aby utraciæ pliki.

source: Error writing to the root directory.
pl: B³±d podczas zapisu do katalogu g³ównego (root).

source: If you leave your file system as FAT16, then you will have no problems.
pl: Je¶li pozostawisz swój system plików jako FAT16, to nie bêdziesz mia³(a) ¿adnych problemów.

source: If you convert to FAT16, and MS Windows is installed on this partition, then you must re-install the MS Windows boot loader. If you want to do this, you should consult the Parted manual (or your distribution's manual).
pl: Je¿eli dokonasz konwersji do FAT16 i system MS Windows jest zainstalowany na tej partycji, to wtedy musisz przeinstalowaæ program ³aduj±cy (boot loader) MS Windows. Je¶li chcesz to zrobiæ, to proszê przeczytaj dokumentacjê programu Parted (lub dokumentacjê Twojej dystrybucji systemu).

source: If you leave your file system as FAT32, then you will not introduce any new problems.
pl: Je¶li pozostawisz swój system plików jako FAT32, to wtedy nie bêdziesz mia³(a) ¿adnych nowych problemów.
